# range старт, стоп, шаг
# range(0, 10, 2)
# r = list(range(0, 10, 2)) # функция list - создает список. Функция range - создаёт объект диапазона чисел от 0 до 10 включительно.
# print(r)
# list = (0, 1, 2, 3) # Функция range - создаёт объект диапазона чисел от 0 до 10 включительно.
for i in range(11):


# Функция range() используется для создания последовательности чисел.
# Она широко применяется в циклах, таких как for, для итерации по заданному диапазону чисел.
# Функция range() позволяет создавать последовательности с определенным начальным значением, конечным значением и шагом.

# Давайте рассмотрим синтаксис:
# range(start, stop, step)