# Напишите код, который принимает одно значение и выводит на печать строку целиком
# text = input()
# print(text)

# Напишите код, который принимает одно значение и выводит на печать второй символ строки
text = input()
second_char = text[1:2]
print(second_char)