# Напишите код, который принимает одно значение и выводит на печать строку целиком
# text = input()
# print(text)

# Напишите код, который принимает одно значение и выводит на печать второй символ строки
# text1 = input()
# second_char = text1[1:2]
# print(second_char)

# Напишите код, который принимает одно значение и выводит на печать первые четыре символа строки
# text2 = input()
# four_chars = text2[:4]
# print(four_chars)

# Напишите код, который принимает одно значение и выводит на печать только четные индексы строки (отсчет начинается с 0, пробел считается за символ)
# text3 = input()
# even_chars = text3[::2]
# print(even_chars)

# Напишите код, который принимает одно значение и выводит на печать предпоследний символ строки
# text4 = input()
# penultimate_chars = text4[-2:-1:]
# print(penultimate_chars)

# Напишите код, который принимает два строчных значения (каждое с новой строки) и складывает их, без пробелов
# str_1 = input()
# str_2 = input()
# concatenation = str_1+str_2
# print(concatenation)

# Напишите код, который принимает два строчных значения (каждое с новой строки) и выводит первое значение 2 раза подряд и второе значение 3 раза подряд, без пробелов
# str_3 = input()
# str_4 = input()
# increased_line = str_3*2+str_4*3
# print(increased_line)

# Напишите код, который принимает два значения (каждое с новой строки) и складывает их, c пробелами
str_5 = input()
str_6 = input()
increased_line = str_5 + " " + str_6
print(increased_line)