# Напишите код, который принимает одно значение и выводит на печать строку целиком
text = input()
print(text)

